[
  {
    "id": 1,
    "title": "Computers and Coding Foundations",
    "instructor": "Sarah Johnson",
    "price": "$89",
    "thumbnail": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 4-8",
    "duration": "12 weeks",
    "category": "Programming",
    "description": "Build strong understanding of what computers do and how programs work. Learn to think logically, plan step-by-step instructions, and express creativity through code.",
    "techStack": "Scratch",
    "capstoneProject": "A complete Scratch game or story with animations, scoring, and user interaction.",
    "keyTakeaways": "Confidence with computers, ability to think algorithmically, and an early appreciation for computational creativity.",
    "rating": 4.8,
    "students": 1200,
    "learningGoals": "Students build a strong understanding of what computers do and how programs work. They learn to think logically, plan step-by-step instructions, and express creativity through code. By the end of the course, they can design simple interactive games and animations while using correct coding concepts such as loops, conditionals, and variables.",
    "sessionOutline": [
      "Introduction to computers and how programs follow instructions",
      "Understanding algorithms through real-life examples and puzzles",
      "Exploring the Scratch interface and creating a first animated scene",
      "Working with motion, looks, and events to make sprites move and react",
      "Using loops and conditionals to build interactive behaviours",
      "Introducing variables to keep scores and control character actions",
      "Building and testing a simple game using learned concepts",
      "Debugging and improving programs systematically",
      "Introduction to Blockly and comparing block-based environments",
      "Designing an independent project idea and planning its logic",
      "Creating and refining the project",
      "Presenting the finished program and reflecting on problem-solving strategies"
    ]
  },
  {
    "id": 2,
    "title": "Introduction to Google Office",
    "instructor": "Mike Chen",
    "price": "$79",
    "thumbnail": "https://images.unsplash.com/photo-1434626881859-194d67b2b86f?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 4-8",
    "duration": "10 weeks",
    "category": "Productivity",
    "description": "Master Google Docs, Sheets, Slides, and Drive. Develop digital literacy and collaboration skills for school and work.",
    "techStack": "Google Docs, Sheets, Slides, Drive, Chrome",
    "capstoneProject": "A digital portfolio containing one formatted document, a functional spreadsheet, and a slide presentation.",
    "keyTakeaways": "Digital literacy, collaboration skills, and confidence in online productivity tools.",
    "rating": 4.7,
    "students": 980,
    "learningGoals": "Students become fluent with productivity tools used in schools and workplaces. They learn to create, edit, format, and share documents, spreadsheets, and presentations while developing responsible digital habits.",
    "sessionOutline": [
      "Navigating operating systems and browsers; saving and organising files",
      "Introduction to Google Drive and cloud storage",
      "Creating and formatting documents in Google Docs",
      "Inserting images, tables, and hyperlinks for polished reports",
      "Collaboration and real-time editing with shared documents",
      "Basics of Google Sheets: entering data, using formulas, and charts",
      "Using Sheets to organise information such as class scores or expenses",
      "Building a visual presentation with Google Slides",
      "Incorporating text, images, and animations for clear storytelling",
      "Understanding online safety, privacy, and responsible sharing",
      "Mini-project creation combining Docs, Sheets, and Slides",
      "Presentation and peer feedback"
    ]
  },
  {
    "id": 3,
    "title": "Using Excel and Google Sheets for Problem Solving",
    "instructor": "Emily Rodriguez",
    "price": "$89",
    "thumbnail": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 4-8",
    "duration": "11 weeks",
    "category": "Data Analysis",
    "description": "Explore data organization and analysis with formulas, charts, and real-world applications like budgets and surveys.",
    "techStack": "Microsoft Excel, Google Sheets",
    "capstoneProject": "A practical spreadsheet that collects, analyses, and visualises real data, such as a class survey or personal finance tracker.",
    "keyTakeaways": "Foundational data literacy, logical thinking, and the ability to use spreadsheets as analytical tools.",
    "rating": 4.6,
    "students": 850,
    "learningGoals": "Students explore how spreadsheets organise and analyse information. They learn formulas, chart creation, and data-driven reasoning using engaging, age-appropriate problems such as budgets, scorecards, and surveys.",
    "sessionOutline": [
      "Introduction to spreadsheets, cells, and data types",
      "Entering and formatting data for readability",
      "Using basic formulas for addition, subtraction, and averages",
      "Understanding absolute and relative references",
      "Sorting and filtering information to conclude",
      "Creating and customising charts to visualise data",
      "Real-world application: tracking a class event or a small budget",
      "Exploring conditional formatting to highlight trends",
      "Collaborative editing and sharing via Google Sheets",
      "Introduction to simple data validation and protection",
      "Designing an independent spreadsheet project",
      "Presentation and interpretation of results"
    ]
  },
  {
    "id": 4,
    "title": "Introduction to AI",
    "instructor": "Dr. Alex Kim",
    "price": "$99",
    "thumbnail": "https://images.unsplash.com/photo-1485827404703-89b55fcc595e?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 4-8",
    "duration": "10 weeks",
    "category": "AI/ML",
    "description": "Learn AI concepts through Teachable Machine and Scratch. Build interactive games that respond to gestures and images.",
    "techStack": "Teachable Machine, Scratch with ML extensions",
    "capstoneProject": "An interactive Scratch or Teachable Machine game that responds to gestures, voices, or images.",
    "keyTakeaways": "Conceptual understanding of AI, creativity in applying technology, and awareness of ethical considerations.",
    "rating": 4.9,
    "students": 1100,
    "learningGoals": "Students learn what artificial intelligence means in simple, concrete terms. They explore how computers recognise patterns and make predictions by training small models that react to sound, image, or motion inputs.",
    "sessionOutline": [
      "Understanding AI through examples from daily life",
      "Concept of learning from data and how computers identify patterns",
      "Introduction to Teachable Machine and image classification",
      "Training models and testing accuracy",
      "Improving results by collecting better examples",
      "Integrating trained models into Scratch projects",
      "Building an interactive AI-driven game or animation",
      "Exploring ethical questions such as bias and fairness",
      "Refining projects and adding creativity",
      "Sharing and discussing projects in class",
      "Presenting the final game and explaining how AI was used",
      "Reflecting on future possibilities of AI and personal interests"
    ]
  },
  {
    "id": 5,
    "title": "Introduction to Python",
    "instructor": "David Park",
    "price": "$129",
    "thumbnail": "https://images.unsplash.com/photo-1526379095098-d400fd0bf935?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 8-12",
    "duration": "12 weeks",
    "category": "Programming",
    "description": "Master Python fundamentals with clear, correct code. Build text-based applications and develop logical thinking skills.",
    "techStack": "Python 3, Replit or Google Colab",
    "capstoneProject": "A text-based application such as a quiz, calculator, or word game demonstrating user interaction and basic control flow.",
    "keyTakeaways": "Solid programming fundamentals, logical thinking, and confidence to tackle independent coding tasks.",
    "rating": 4.8,
    "students": 1500,
    "learningGoals": "Students learn to write clear, correct Python code, understand how programs are structured, and solve small real-world problems. The focus is on reasoning, not memorisation, so learners build a foundation that supports any future language or discipline.",
    "sessionOutline": [
      "Setting up Python and understanding how programs run",
      "Variables, data types, and input/output",
      "Conditional statements and decision-making",
      "Loops and iteration for repetitive tasks",
      "Lists and strings — storing and manipulating collections of data",
      "Functions — writing reusable and organised code",
      "File handling — reading and writing text files",
      "Debugging and common error patterns",
      "Mini-project planning and algorithm design",
      "Building and testing the project",
      "Adding features and improving readability",
      "Project presentation and reflection on logic skills"
    ]
  },
  {
    "id": 6,
    "title": "Programming in C and C++",
    "instructor": "Prof. Lisa Wang",
    "price": "$149",
    "thumbnail": "https://images.unsplash.com/photo-1516116216624-53e697fedbea?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 8-12",
    "duration": "14 weeks",
    "category": "Programming",
    "description": "Learn low-level programming, memory management, and efficient code. Build console applications with structured design.",
    "techStack": "C and C++ Compilers (Code::Blocks, Visual Studio Code)",
    "capstoneProject": "A console-based utility, such as a student record system or menu-driven calculator, showing a structured and modular design.",
    "keyTakeaways": "Understanding of how computers execute code, efficient programming habits, and a strong foundation for advanced languages.",
    "rating": 4.7,
    "students": 750,
    "learningGoals": "Students gain insight into low-level program structure, memory, and performance. They learn how C and C++ code is compiled and executed, and how to write efficient, well-commented programs that handle input, processing, and output.",
    "sessionOutline": [
      "Understanding compilation and the program execution process",
      "Syntax, data types, variables, and operators",
      "Conditional logic and loops",
      "Functions and scope of variables",
      "Arrays and strings — working with collections of data",
      "Structures and basic pointers for memory management",
      "File input/output and simple data storage",
      "Introduction to problem decomposition and modular design",
      "Debugging and common errors in compiled languages",
      "Planning and building a final project",
      "Code review and documentation",
      "Presentation and reflection"
    ]
  },
  {
    "id": 7,
    "title": "Algorithmic Thinking and Version Control",
    "instructor": "James Miller",
    "price": "$119",
    "thumbnail": "https://images.unsplash.com/photo-1551650975-87deedd944c3?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 8-12",
    "duration": "11 weeks",
    "category": "Programming",
    "description": "Think like engineers with flowcharts, Git, and GitHub. Master collaborative development and professional workflows.",
    "techStack": "Flowchart tools (Lucidchart or draw.io), Git, GitHub",
    "capstoneProject": "A group GitHub repository containing a well-documented logical project with branch histories and collaboration evidence.",
    "keyTakeaways": "Strong grasp of algorithmic structure and practical experience using industry-standard version control.",
    "rating": 4.6,
    "students": 920,
    "learningGoals": "Students learn to think like engineers: break problems into steps, represent logic visually, and collaborate using professional version-control tools. The course bridges logical reasoning and real-world software practice.",
    "sessionOutline": [
      "What is an algorithm, and why does structure matter?",
      "Flowcharts and pseudocode — visual logic",
      "Translating logic into real problems, such as sorting and searching",
      "Introduction to Git — repositories, commits, and local workflow",
      "Working with branches and merges",
      "Pushing projects to GitHub and collaborating online",
      "Resolving merge conflicts and using commit messages effectively",
      "Structuring projects and maintaining a readable history",
      "Group exercise — collaborative repository for a shared project",
      "Documentation using README files and basic Markdown",
      "Final project creation and upload",
      "Presentation and code review"
    ]
  },
  {
    "id": 8,
    "title": "Object-Oriented Programming Concepts",
    "instructor": "Dr. Maria Garcia",
    "price": "$139",
    "thumbnail": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 9-12",
    "duration": "13 weeks",
    "category": "Programming",
    "description": "Move from procedural to object-oriented design. Learn classes, inheritance, and polymorphism for modular programs.",
    "techStack": "Python or C++ (OOP focus), IDE of choice",
    "capstoneProject": "A small software system, such as a library manager or inventory tracker, illustrating objects, inheritance, and polymorphism.",
    "keyTakeaways": "Understanding of OOP design principles, code reusability, and professional organisation of projects.",
    "rating": 4.8,
    "students": 680,
    "learningGoals": "Students move from procedural thinking to object-oriented design, learning how to model real-world entities through classes and objects. They develop programs that are modular, reusable, and easier to maintain.",
    "sessionOutline": [
      "Review of procedural concepts and the need for OOP",
      "Understanding classes, objects, and attributes",
      "Defining methods and encapsulation of data",
      "Constructors, destructors, and lifecycle management",
      "Inheritance and code reuse",
      "Polymorphism and method overriding",
      "Access specifiers and data security",
      "Composition vs inheritance — choosing the right structure",
      "Error handling and exceptions in OOP",
      "Building a multi-class project from concept to implementation",
      "Documentation and testing",
      "Presentation and code walk-through"
    ]
  },
  {
    "id": 9,
    "title": "Basics of Data Science",
    "instructor": "Dr. Robert Taylor",
    "price": "$159",
    "thumbnail": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 9-12",
    "duration": "12 weeks",
    "category": "Data Science",
    "description": "Collect, clean, analyze, and visualize data with Python, Pandas, and Matplotlib. Develop critical thinking through real datasets.",
    "techStack": "Python, Pandas, Matplotlib, Google Colab",
    "capstoneProject": "Analyse a publicly available dataset (such as sports scores or weather records) and present findings through graphs and a written summary.",
    "keyTakeaways": "Confidence with data handling, understanding of basic analytics, and a foundation for advanced ML or statistics courses.",
    "rating": 4.7,
    "students": 890,
    "learningGoals": "Students learn to collect, clean, analyse, and visualise data. The course develops numerical reasoning and critical thinking through hands-on projects using real datasets.",
    "sessionOutline": [
      "Understanding what data science is and its applications",
      "Loading datasets and exploring structure and types",
      "Cleaning and pre-processing data",
      "Computing descriptive statistics and basic summary measures",
      "Visualising trends with Matplotlib and Pandas charts",
      "Working with categorical data and grouping",
      "Identifying correlations and simple patterns",
      "Introduction to CSV files and basic data import/export",
      "Mini analysis project design and planning",
      "Performing analysis and visualisation",
      "Preparing findings for presentation",
      "Presenting projects and reflecting on insights"
    ]
  },
  {
    "id": 10,
    "title": "Applied Math with Python or R",
    "instructor": "Dr. Jennifer Lee",
    "price": "$149",
    "thumbnail": "https://images.unsplash.com/photo-1635070041078-e363dbe005cb?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 9-12",
    "duration": "13 weeks",
    "category": "Mathematics",
    "description": "See mathematics come alive through computation. Apply algebra, geometry, and statistics using code visualization.",
    "techStack": "Python with NumPy and Matplotlib or R with ggplot2",
    "capstoneProject": "A simulation or data visualisation demonstrating a mathematical principle, for example, a random walk model or geometric pattern exploration.",
    "keyTakeaways": "Improved mathematical intuition, ability to express quantitative ideas through code, and preparation for data-driven STEM fields.",
    "rating": 4.6,
    "students": 720,
    "learningGoals": "Students see mathematics come alive through computation. They apply algebra, geometry, probability, and statistics concepts using code to visualise and experiment with real phenomena.",
    "sessionOutline": [
      "Connecting mathematical concepts to programming",
      "Using Python or R for basic calculations and symbolic representation",
      "Graphing linear and quadratic functions",
      "Exploring geometry through coordinate transformations",
      "Probability simulation using random numbers",
      "Statistical analysis of sample data",
      "Creating visualisations that explain mathematical ideas",
      "Modelling real-world situations such as population growth or motion",
      "Designing a mathematical investigation project",
      "Writing and testing the simulation code",
      "Interpreting and communicating results",
      "Presentation and peer feedback"
    ]
  },
  {
    "id": 11,
    "title": "Python for Real-World Applications",
    "instructor": "Mark Thompson",
    "price": "$169",
    "thumbnail": "https://images.unsplash.com/photo-1526379095098-d400fd0bf935?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 11-College",
    "duration": "14 weeks",
    "category": "Programming",
    "description": "Apply Python beyond basics to solve practical problems. Automate tasks, web scraping, and API integration.",
    "techStack": "Python, standard libraries (os, datetime, requests), IDE of choice",
    "capstoneProject": "Automate a real-world task such as gathering weather data, managing files, or generating reports. Include proper documentation and reusable functions.",
    "keyTakeaways": "Practical Python proficiency, ability to write reliable scripts, and experience applying programming to real problems.",
    "rating": 4.8,
    "students": 1050,
    "learningGoals": "Students learn to apply Python beyond basic exercises to solve practical problems, automate tasks, and integrate with real-world systems. They gain experience designing scripts for productivity, data collection, and system interactions.",
    "sessionOutline": [
      "Recap of Python basics and control structures",
      "File handling and manipulation (reading/writing files, CSV/JSON)",
      "Automating routine tasks with scripts",
      "Web scraping with libraries like requests and BeautifulSoup",
      "Working with APIs and JSON data",
      "Exception handling and logging for robust scripts",
      "Modular programming and reusable function libraries",
      "Introduction to virtual environments and package management",
      "Debugging, testing, and documenting scripts",
      "Capstone project design session: selecting a real-world problem",
      "Implementation, testing, and refinement",
      "Presentation of automated solution and code walk-through"
    ]
  },
  {
    "id": 12,
    "title": "Data Structures and Algorithms",
    "instructor": "Dr. Kevin Brown",
    "price": "$179",
    "thumbnail": "https://images.unsplash.com/photo-1516116216624-53e697fedbea?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 11-College",
    "duration": "15 weeks",
    "category": "Programming",
    "description": "Master efficient computation and algorithmic thinking. Learn data structures, sorting, searching, and optimization.",
    "techStack": "Python or C++, IDE, visual algorithm tools (optional)",
    "capstoneProject": "Design and implement a mini library of data structures and algorithms that can solve a complex problem, such as a pathfinding simulation or a text processing system.",
    "keyTakeaways": "Ability to analyse and implement core data structures and algorithms, understand trade-offs, and optimise computational efficiency.",
    "rating": 4.9,
    "students": 820,
    "learningGoals": "Students understand the foundations of efficient computation, algorithmic thinking, and memory/data management. They learn to choose appropriate data structures and implement algorithms for performance-critical applications.",
    "sessionOutline": [
      "Review of complexity analysis (Big O notation)",
      "Arrays, linked lists, stacks, and queues",
      "Trees (binary, AVL) and graph representations",
      "Hashing and hash tables",
      "Sorting algorithms (merge, quick, heap)",
      "Searching algorithms (binary search, BFS, DFS)",
      "Recursion and dynamic programming",
      "Algorithm optimisation techniques",
      "Implementing standard data structures from scratch",
      "Applying algorithms to solve real-world problems",
      "Code review and debugging complex algorithms",
      "Final exam and reflection on algorithm design"
    ]
  },
  {
    "id": 13,
    "title": "Introduction to Databases (DBMS)",
    "instructor": "Dr. Amanda White",
    "price": "$159",
    "thumbnail": "https://images.unsplash.com/photo-1544383835-bda2bc66a55d?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 11-College",
    "duration": "12 weeks",
    "category": "Database",
    "description": "Structure, query, and manipulate data in relational databases. Learn SQL, normalization, and database design.",
    "techStack": "MySQL/PostgreSQL/SQLite, Python integration (optional), SQL IDE",
    "capstoneProject": "Create a small relational database (e.g., inventory system or student records) with a front-end query interface, demonstrating CRUD operations and relationships.",
    "keyTakeaways": "Ability to design, implement, and query relational databases and integrate them into software applications.",
    "rating": 4.7,
    "students": 650,
    "learningGoals": "Students learn to structure, query, and manipulate data in relational databases, understanding the principles of database design, normalisation, and transactions.",
    "sessionOutline": [
      "Database fundamentals: tables, rows, columns",
      "SQL queries: SELECT, INSERT, UPDATE, DELETE",
      "Filtering, sorting, and aggregating data",
      "Joins, subqueries, and set operations",
      "Database normalisation and relationships",
      "Indexing and performance optimisation",
      "Transactions and constraints for data integrity",
      "Connecting Python scripts to a database",
      "Designing a simple relational database for a project",
      "Testing, querying, and reporting from the database",
      "Capstone project presentation",
      "Final assessment and portfolio review"
    ]
  },
  {
    "id": 14,
    "title": "Introduction to Machine Learning",
    "instructor": "Dr. Carlos Mendez",
    "price": "$189",
    "thumbnail": "https://images.unsplash.com/photo-1555949963-aa79dcee981c?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 11-College",
    "duration": "14 weeks",
    "category": "AI/ML",
    "description": "Learn ML foundations from preprocessing to model evaluation. Explore supervised and unsupervised learning with real projects.",
    "techStack": "Python, scikit-learn, Pandas, Matplotlib, Google Colab",
    "capstoneProject": "Predict outcomes from a real dataset (e.g., housing prices, student performance, or stock trends), including data cleaning, model training, and evaluation.",
    "keyTakeaways": "Foundational understanding of ML pipelines, model selection, and practical application of algorithms to real datasets.",
    "rating": 4.8,
    "students": 950,
    "learningGoals": "Students learn the foundations of machine learning, from preprocessing data to training and evaluating models. They explore supervised and unsupervised learning through practical projects.",
    "sessionOutline": [
      "Introduction to ML concepts: supervised vs unsupervised learning",
      "Data preprocessing: cleaning, normalisation, feature engineering",
      "Regression models: linear and polynomial regression",
      "Classification models: k-NN, decision trees, logistic regression",
      "Evaluation metrics: accuracy, precision, recall, F1-score",
      "Clustering algorithms: k-means and hierarchical clustering",
      "Model training, validation, and cross-validation",
      "Overfitting, underfitting, and regularisation techniques",
      "Mini ML project: from dataset to model evaluation",
      "Communicating insights with visualisations",
      "Advanced topics: neural networks introduction",
      "Capstone project presentation and peer review"
    ]
  },
  {
    "id": 15,
    "title": "Introduction to Artificial Intelligence",
    "instructor": "Dr. Rachel Green",
    "price": "$199",
    "thumbnail": "https://images.unsplash.com/photo-1485827404703-89b55fcc595e?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 11-College",
    "duration": "15 weeks",
    "category": "AI/ML",
    "description": "Explore AI concepts, problem-solving strategies, and intelligent agent design. Create AI applications and simulations.",
    "techStack": "Python, basic AI libraries (e.g., OpenAI API, Gym), optional TensorFlow/PyTorch introduction",
    "capstoneProject": "Develop a simple AI agent (e.g., maze solver, tic-tac-toe player, or chatbot) demonstrating reasoning, decision-making, and evaluation.",
    "keyTakeaways": "Understanding of AI principles, search and decision-making strategies, and hands-on AI implementation.",
    "rating": 4.9,
    "students": 780,
    "learningGoals": "Students explore AI concepts, problem-solving strategies, and intelligent agent design. They learn how to simulate decision-making and create simple AI applications.",
    "sessionOutline": [
      "AI concepts: agents, environments, and problem spaces",
      "Search algorithms: BFS, DFS, A*, heuristic search",
      "Game AI and decision trees",
      "Knowledge representation and reasoning basics",
      "Simple natural language processing",
      "Reinforcement learning introduction",
      "Ethical considerations in AI",
      "Mini project: AI agent in a game environment",
      "Testing, debugging, and performance analysis",
      "Presenting the AI solution and explaining design choices",
      "Advanced AI applications",
      "Final project showcase and reflection"
    ]
  },
  {
    "id": 16,
    "title": "Introduction to R for Data Science",
    "instructor": "Dr. Michael Davis",
    "price": "$169",
    "thumbnail": "https://images.unsplash.com/photo-1555949963-aa79dcee981c?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "Grades 11-College",
    "duration": "13 weeks",
    "category": "Data Science",
    "description": "Master R for statistical computing and data visualization. Learn tidyverse, ggplot2, and exploratory data analysis.",
    "techStack": "R, RStudio, tidyverse, ggplot2",
    "capstoneProject": "Analyse a real-world dataset in R, generate visualisations, perform basic statistical analysis, and produce a report summarising findings.",
    "keyTakeaways": "Competence in R for data manipulation, visualisation, and preliminary statistical analysis, providing a strong foundation for data science.",
    "rating": 4.6,
    "students": 580,
    "learningGoals": "Students gain proficiency in R for statistical computing, data visualisation, and exploratory data analysis. They learn how to process data efficiently and communicate insights effectively.",
    "sessionOutline": [
      "Basics of R programming and RStudio environment",
      "Data types, vectors, matrices, and data frames",
      "Data manipulation with dplyr",
      "Visualisation using ggplot2 and basic plots",
      "Summary statistics and descriptive analytics",
      "Working with real datasets: CSV, Excel, APIs",
      "Introduction to statistical tests and hypothesis testing",
      "Mini analysis project: data exploration and visualisation",
      "Reporting findings with reproducible RMarkdown",
      "Peer review and project discussion",
      "Advanced visualisation techniques",
      "Final project presentation and portfolio"
    ]
  },
  {
    "id": 17,
    "title": "Math Support Track (All Levels)",
    "instructor": "Dr. Patricia Wilson",
    "price": "$99",
    "thumbnail": "https://images.unsplash.com/photo-1635070041078-e363dbe005cb?w=400&h=300&fit=crop&q=80",
    "gradeLevel": "High School-College",
    "duration": "Ongoing",
    "category": "Mathematics",
    "description": "Tailored math support across all curriculum levels. Reinforce algebra, calculus, probability, and linear algebra concepts.",
    "techStack": "Python (NumPy/SymPy), R (optional), graphing tools",
    "capstoneProject": "Comprehensive math assessment and targeted improvement plan with regular progress tracking.",
    "keyTakeaways": "Strengthened mathematical foundation, improved quantitative reasoning, and confidence in applying math in programming and data science.",
    "rating": 4.7,
    "students": 1200,
    "learningGoals": "Provide tailored support in mathematical concepts required across the curriculum, reinforcing problem-solving, symbolic reasoning, and computational applications.",
    "sessionOutline": [
      "Assessment of existing math skills",
      "Targeted reinforcement of algebra, calculus, probability, and linear algebra",
      "Problem-solving workshops and guided exercises",
      "Regular quizzes and progress tracking",
      "Peer tutoring and collaborative exercises",
      "Integration with programming and data science projects"
    ]
  }
]

